Rails/todo_list/app/controllers/tasks_controller.rb

UPDATE "tasks" SET "description" = ?, "deadline" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "Resume workshop"], ["deadline", "2015-05-28 22:30:00.000000"], ["updated_at", "2015-05-28 14:04:38.951177"], ["id", 2]]
---
  def update
     @task.update(task_params)

INSERT INTO "tasks" ("description", "deadline", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Hoby community service presentation"], ["deadline", "2015-05-29 19:00:00.000000"], ["created_at", "2015-05-28 12:47:09.904970"], ["updated_at", "2015-05-28 12:47:09.904970"]]
---
  def create
    #@task = Task.new(task_params)
    @task  = Task.create(task_params)