Rails/ToDo_app/app/controllers/to_dos_controller.rb

  def index
    @to_dos = ToDo.all
---
SELECT "to_dos".* FROM "to_dos"

  def create
    @to_do = ToDo.new(to_do_params)

    respond_to do |format|
      if @to_do.save
---
INSERT INTO "to_dos" ("title", "notes", "done", "due", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Practice"], ["notes", "need lots!"], ["done", "f"], ["due", "2015-05-06"], ["created_at", "2015-05-05 13:59:20.850003"], ["updated_at", "2015-05-05 13:59:20.850003"]]

    def set_to_do
      @to_do = ToDo.find(params[:id])
---
SELECT  "to_dos".* FROM "to_dos" WHERE "to_dos"."id" = ? LIMIT 1  [["id", 1]]