Rails/nicole_twitter/app/controllers/epicenter_controller.rb

  def feed

  @following_tweets = []

  @tweets = Tweet.all
---
SELECT "tweets".* FROM "tweets"