Rails/Records_app/app/controllers/records_controller.rb

SELECT "records".* FROM "records"
---
  def index
    @records = Record.all

INSERT INTO "records" ("band", "title", "bought", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["band", "Counting Crow"], ["title", "Under the Wonderland"], ["bought", "t"], ["year", "2014-09-15"], ["created_at", "2015-05-06 15:29:39.061599"], ["updated_at", "2015-05-06 15:29:39.061599"]]
---
  def create
    @record = Record.new(record_params)

    respond_to do |format|
      if @record.save

SELECT  "records".* FROM "records" WHERE "records"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_record
      @record = Record.find(params[:id])