Rails/tech_talent_blog/app/views/blog_posts/your_posts.html.erb

SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."user_id" = ?  [["user_id", 2]]
---
<div class="row">
	<% current_user.blog_posts.each do |blog_post| %>