Rails/nicole_twitter1/app/controllers/epicenter_controller.rb

SELECT "tweets".* FROM "tweets"
SELECT "users".* FROM "users"
---
  def feed
  @following_tweets = []

  @tweets = Tweet.all
  @users = User.all