Rails/nicole_twitter1/app/controllers/tweets_controller.rb

INSERT INTO "tweets" ("message", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["message", "Yay! this app is working!!"], ["user_id", 1], ["created_at", "2015-05-26 15:11:07.513066"], ["updated_at", "2015-05-26 15:11:07.513066"]]
---
  def create
    @tweet = Tweet.new(tweet_params)

    respond_to do |format|
      if @tweet.save