Rails/classroom/app/controllers/students_controller.rb

  def index
    @students = Student.all
---
SELECT "students".* FROM "students"

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("name", "age", "classroom", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Bob"], ["age", 14], ["classroom", "Freshman"], ["created_at", "2015-05-18 01:39:04.127906"], ["updated_at", "2015-05-18 01:39:04.127906"]]

    def set_student
      @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]