Rails/classroom/app/controllers/teachers_controller.rb

SELECT "teachers".* FROM "teachers"
---
  def index
    @teachers = Teacher.all