Rails/tech_talent_blog/app/controllers/blog_posts_controller.rb

def user_profile
  @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]

  def create
    @blog_post = BlogPost.new(blog_post_params)

    respond_to do |format|
      if @blog_post.save
---
INSERT INTO "blog_posts" ("title", "blog_entry", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @blog_post.update(blog_post_params)
---
UPDATE "blog_posts" SET "title" = ?, "updated_at" = ? WHERE "blog_posts"."id" = ?  [["title", "Efficiency"], ["updated_at", "2015-05-19 14:50:02.012234"], ["id", 2]]