Rails/travel_app1/app/views/destinations/index.html.erb

SELECT "destinations".* FROM "destinations" WHERE "destinations"."country" = ?  [["country", "japan"]]
---
  <% @my_countries.each do |c| %>
    <li><%= link_to "#{c.country}", controller: "destinations", country: "#{c.country}" %></li>