Rails/travel1/app/controllers/destinations_controller.rb

  def index
    if params[:country] == nil
      @destinations = Destination.all
    else
      @destinations = Destination.where(country: params[:country].titleize)
    end

    # Never trust parameters from the scary internet, only allow the white list through.


    # unordered
    @my_countries = Destination.select(:country).distinct
---
SELECT "destinations".* FROM "destinations"
SELECT "destinations".* FROM "destinations" WHERE "destinations"."country" = ?  [["country", "Japan"]]
SELECT DISTINCT "destinations"."country" FROM "destinations"  ORDER BY "destinations"."country" ASC

  def create
    @destination = Destination.new(destination_params)

    respond_to do |format|
      if @destination.save
---
INSERT INTO "destinations" ("city", "country", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["city", "Melborne"], ["country", "Australia"], ["description", "visit family"], ["created_at", "2015-05-11 12:49:28.443839"], ["updated_at", "2015-05-11 12:49:28.443839"]]

  def update
    respond_to do |format|
      if @destination.update(destination_params)
---
UPDATE "destinations" SET "address" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "destinations"."id" = ?  [["address", "Alte Jakobstraße 124-128, 10969 Berlin-Kreuzberg, Duetschland"], ["latitude", 52.50407999999999], ["longitude", 13.39881], ["updated_at", "2015-06-01 15:03:14.703741"], ["id", 8]]

  def destroy
    @destination.destroy
---
DELETE FROM "destinations" WHERE "destinations"."id" = ?  [["id", 5]]

    def set_destination
      @destination = Destination.find(params[:id])
---
SELECT  "destinations".* FROM "destinations" WHERE "destinations"."id" = ? LIMIT 1  [["id", 5]]