Rails/ajax-sample/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @posts = Post.all

INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "I'm feeling great today! I had a protein shake for breakfast and it gave me a boost!"], ["created_at", "2015-05-28 12:29:48.509672"], ["updated_at", "2015-05-28 12:29:48.509672"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_post
      @post = Post.find(params[:id])