Rails/travel1/app/views/destinations/index.html.erb

  <% @my_countries.each do |c| %>
    <li><%= link_to "#{c.country}", controller: "destinations", country: "#{c.country}" %></li>
---
SELECT "destinations".* FROM "destinations" WHERE "destinations"."country" = ?  [["country", "Japan"]]