Rails/travel_app/app/controllers/destinations_controller.rb

SELECT "destinations".* FROM "destinations"
SELECT "destinations".* FROM "destinations" WHERE "destinations"."country" = ?  [["country", "japan"]]
SELECT DISTINCT "destinations"."country" FROM "destinations"  ORDER BY "destinations"."country" ASC
---
  def index
    if params[:country] == nil
      @destinations = Destination.all
    else
      @destinations = Destination.where(country: params[:country].titleize)
    end


  # unordered
    # @my_countries = Destination.select(:country).distinct

    # alphabetical
    @my_countries = Destination.select(:country).order(:country).distinct

INSERT INTO "destinations" ("city", "country", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["city", "Melbourne"], ["country", "Australia"], ["description", "Visit Family"], ["created_at", "2015-05-16 18:32:40.326957"], ["updated_at", "2015-05-16 18:32:40.326957"]]
---
  def create
    @destination = Destination.new(destination_params)

    respond_to do |format|
      if @destination.save

UPDATE "destinations" SET "avatar_file_name" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "destinations"."id" = ?  [["avatar_file_name", "toronto.jpg"], ["avatar_file_size", 10722], ["avatar_updated_at", "2015-05-16 21:11:08.865818"], ["updated_at", "2015-05-16 21:11:09.217331"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @destination.update(destination_params)

DELETE FROM "destinations" WHERE "destinations"."id" = ?  [["id", 7]]
---
  def destroy
    @destination.destroy

SELECT  "destinations".* FROM "destinations" WHERE "destinations"."id" = ? LIMIT 1  [["id", 7]]
---
    def set_destination
      @destination = Destination.find(params[:id])